// JavaScript-ში hoisting არის მექანიზმი, რომლის დროსაც ცვლადები და ფუნქციები "წამოწეულია" (hoist) სკრიპტის ზედა ნაწილში მათი დეკლარაციის ან ინიციალიზაციის გარეშე
//  ეს ნიშნავს, რომ შესაძლებელია ცვლადებზე ან ფუნქციებზე წვდომა მათ განსაზღვრამდე
// ფუნქციების დეკლარაციები (function declarations) მთლიანად "იწევა" კოდის ზედა ნაწილში ეს ნიშნავს რომ შეგიძლიათ გამოიძახოთ ფუნქცია მისი განსაზღვრამდე



// let და const დეკლარაციებიც "იწევა" მაგრამ მათ აქვთ Temporal Dead Zone (TDZ) რაც ნიშნავს რომ მათი გამოყენება შეუძლებელია განსაზღვრამდე
// let და const ცვლადები ხელმისაწვდომი არ არის მანამ სანამ კოდი ფიზიკურად არ მივა მათ დეკლარაციამდე
// Const ცვლადს დამატებითი შეზღუდვა აქვს: მისი ინიციალიზაცია აუცილებლად უნდა მოხდეს დეკლარაციის დროს


// Bubbling და capturing არის ორი ფაზა, რომელშიც DOM მოვლენის (event) გავრცელება ხდება ელემენტების იერარქიაში.
//  ეს მექანიზმები განსაზღვრავენ, თუ როგორ გადაადგილდება მოვლენა DOM-ის ხის სხვადასხვა ელემენტზე.

// Capturing (capture phase):

// მოვლენა იწყებს გავრცელებას DOM-ის ყველაზე ზედა ელემენტიდან (window) და ჩამოდის დაბლა კონკრეტული მიზნის (target) ელემენტამდე.
// ამ ფაზას "მინუსიდან ნულამდე" მოძრაობაც ეწოდება.


// Bubbling (bubble phase):
// მოვლენა იწყებს გავრცელებას იმავე მიზნის ელემენტიდან უკან მაღლა, DOM-ის ზედა ელემენტებამდე.

